Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: དཔའ་དང་རྟུལ་ཕོད་གང་ཟག་དམ་པ་མཆོག །
en: “True and good man, you are brave and heroic.

source: སྲིད་པ་ཞི་བ་གང་ཟག་དམ་པ་མཆོག །
en: True and good man, you have pacified craving.

source: སྲེད་པ་ཞི་ཞིང་ཞི་གནས་རབ་ཏུ་སྟོན། །
en: You demonstrate tranquility and the pacification of craving.

source: རྒྱལ་བ་རབ་ཏུ་ཞི་བ་འདི་ལ་འཇུག །
en: Victor, teach us this supreme peace.

source: རྒྱལ་བ་སྟོང་པ་ཉིད་ཞི་རབ་བསྟན་གསོལ། །
en: “Victor, please teach us about emptiness and peace!

source: རྒྱལ་བ་སྟོང་པ་ཉིད་འདི་ལ་ཡང་འཇུག །
en: Victor, please teach us about emptiness.

source: ཁ་དོག་དུང་དང་ཁ་བ་འདྲ་བ་ཡི། །ཞི་བ་མཛེས་པའི་སྟོང་པ་ཉིད་བསྟན་གསོལ། །
en: Please teach us about emptiness that is adorned with peace Just as color adorns a conch shell or snow.

source: ཉན་ཐོས་ཀྱི་ནི་འདི་ལ་ཚོགས་རྣམས་སྤངས། །སྟོན་གྱི་ཉི་མ་ཟླ་བའི་དཀྱིལ་འཁོར་ལྟར། །གཙོ་བོ་དག་གིས་ཤིན་ཏུ་གསལ་ཤིང་མཛེས། །
en: “The multitudes of hearers have left this place, And the highest beings illuminate and adorn it Like the sun and moon in autumn.

source: འདིར་ནི་ལམ་ཞི་སྟོང་པ་ཉིད་བསྟན་གསོལ། །
en: Now, please teach about the path, peace, and emptiness.

source: བརྒྱ་བྱིན་ཚངས་པའི་སྐད་ལྟར་སྒྲ་དབྱངས་སྙན། །
en: “Your voice is sweet and melodious like the voice of Śakra and Brahmā.

source: སེམས་ཅན་དམའ་ལ་ཐུགས་བརྩེ་ཆེན་པོ་ཡིས། །ཐུབ་པ་འདི་ནི་སྟོང་པ་ཉིད་ལ་འཇུག །
en: Sage, out of your great love for inferior beings, Please teach us about emptiness.

source: མྱ་ངན་དང་བྲལ་འགྲོ་བ་འདི་ལ་ཚིམ། །
en: Free these beings from mental anguish and bring them relief.

source: དམའ་བ་སྤྱོད་པ་རྟག་ཏུ་བྱིན་བརླབས་པས། །ཤེས་རབ་མང་གཟིགས་སྟོང་པ་ཉིད་ཞི་གསུངས། །
en: “Since you constantly bless those who engage in inferior forms of conduct, Gaze upon the multitude with your insight and tell us about emptiness and peace.

source: སྡིག་པ་བཅོམ་ཞིང་ཉེས་ཚོགས་དྲི་མ་མེད། །འདི་ནི་འགྲོ་ལ་ཐེག་པ་ངན་པ་སྤངས། །
en: The beings here have conquered evil, are not stained by the multitude of faults, And have given up the inferior vehicles.

source: དགེ་བའི་མཚན་ཉིད་སྤྱོད་ཡུལ་རབ་ཉམས་པས། །ཀྱེ་མའོ་ད་ལྟར་སྟོང་པ་ཉིད་ཞི་གསུངས། །
en: “Alas, since the range of your virtuous characteristics will one day be gone, Please tell us now about emptiness and peace.

source: རྨ་བྱ་ངང་པ་ནེ་ཙོ་སྐེ་ཀ་དབྱངས། །ཉམས་པའི་ཕྱོགས་ཆ་ཅན་གྱི་སྒྲ་རྣམས་འཇིག །
en: With your voice as melodious as a peacock, swan, and parrot, Please destroy the sounds of those who hold corrupt points of view.”

source: ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་ཨུད་པལ་དང་། པད་མོ་དང་།
en: After they praised him with these verses, they tossed blue, pink, red, and white lotus flowers.

source: ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀས་མངོན་པར་གཏོར་ཏོ། །འཕགས་པ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །ལེའུ་བཞི་པའོ།། །།
en: This was the fourth chapter of the Great Vehicle sūtra entitled “The Acceptance That Tames Beings with the Sky-Colored Method of Perfect Conduct.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་མཐའ་ཡས་པའི་ཚོགས་ཀྱི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་ཁང་པ་བརྩེགས་པ་ན་མི་བཞུགས་པ་དེ་ཙམ་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དོན་གྱི་སླད་དུ་ལྷ་རྫས་ཀྱི་གསེར་དང་། ལྷ་རྫས་ཀྱི་བཻ་དཱུརྱ་སྔོན་པོའི་སྐས་མངོན་པར་སྤྲུལ་ཏེ།
en: Chapter 5 Then the bodhisattva King of the Infinite Accumulation of Wisdom manifested staircases made of divine gold and divine blue beryl for the Blessed One that equaled the number of storied mansions in which he was not residing.

source: སྐས་དེ་དག་གི་ངོས་གཉིས་ལ་བྲམ་ཟེའི་བྱིས་པ་ཚེ་ལོ་སུམ་ཅུ་པ་ལྟ་བུ་ཚངས་དབྱངས་དང་ལྡན་པ་གསེར་གྱི་དབྱིག་པ་དང་གདུགས་འཛིན་པ། ཚངས་པའི་སྤྱོད་ལམ་དང་ལྡན་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་མངོན་པར་སྤྲུལ་ཏོ། །
en: He manifested 84,000 young brahmins on both sides of those staircases. They were about thirty years old, had voices as melodious as Brahmā, held parasols with poles made out of gold, and practiced the religious life.

source: དེ་ནས་བྲམ་ཟེའི་བྱིས་པ་དེ་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །ཁྱོད་ནི་རབ་ཉོན་མོངས་ལ་སྔོན་ཐུགས་བསྐྱེད། །ཉོན་མོངས་ཐེག་ལ་བྱང་ཆུབ་ཕན་པའི་རྒྱུ། །
en: Those young brahmins prostrated to the Blessed One with their palms together and praised him with the following verses: “Long ago in this thoroughly afflicted realm, you generated the thought of awakening, The primary cause that helps one attain awakening in the course of the afflictions.

source: ཉོན་མོངས་ཞི་ཕྱིར་རྒྱལ་བ་བསྙེན་ཀྱང་བཀུར། །
en: You served past victors in order to pacify your afflictions, And you used afflictions as skillful means.

source: ཉོན་མོངས་ཐབས་མཛད་རྒྱལ་བ་འདིར་གཤེགས་གསོལ། །
en: Victor, please come to this place!

source: ཉོན་མོངས་སྤྱོད་པ་ཐམས་ཅད་ཁྱོད་ཀྱིས་སྤངས། །སེམས་ཅན་ཉོན་མོངས་ལ་ནི་རྟག་ཏུ་གཉེན། །ཁྱོད་ནི་ཉོན་མོངས་ལས་ལས་འགྲོ་བ་བཟློག །ཉོན་མོངས་རྒལ་བའི་རྒྱུས་ནི་རྟག་ཏུ་མྱོས། །
en: “You have abandoned all forms of afflicted conduct, You always act as a friend for afflicted beings, And you turn them away from karma and afflictions.

source: ཉོན་མོངས་མ་རུངས་ཁྱོད་ཀྱིས་རབ་ཏུ་ཞི། །
en: Since you overcome afflictions, “You pacify their ever-intoxicating vicious afflictions.

source: བདག་གི་བློས་ནི་ཉོན་མོངས་དྲ་བ་བཅད། །འགྲོ་བ་རྟག་ཏུ་ཉོན་མོངས་ཆུ་ལས་སྒྲོལ། །
en: You severed the web of afflictions with your own intellect And permanently liberate beings from the river of the afflictions.

source: ཉོན་མོངས་སུན་འབྱིན་རྒྱལ་བ་འདིར་གཤེགས་གསོལ། །
en: Victor who eradicates the afflictions, please come to this place!

source: ཉོན་མོངས་ཞིང་དུ་བྱང་ཆུབ་དམ་པར་རེག །
en: “You reached supreme awakening in this afflicted realm.

source: ཡེ་ཤེས་སྒྲོན་འཆང་འགྲོ་བ་ཤེས་ཉམས་པའི། །སེམས་ཅན་ཐམས་ཅད་ལ་ནི་ཐར་སྟོན་པ། །
en: You hold the torch of wisdom and reveal liberation To all beings with diminished understanding.

source: ཉོན་མོངས་སྙོན་སྨོངས་ཞི་ཕྱིར་འདིར་གཤེགས་གསོལ། །
en: Please come to this place to pacify afflictions and suffering!

source: ཡེ་ཤེས་འོད་ཟེར་གྱིས་ནི་རྣམ་ཐར་སྟོན། །ཁྱོད་ཐུགས་བརྩེ་བས་འགྲོ་བ་ཤེས་ཉམས་ཁྱབ། །ཡེ་ཤེས་ཀྱིས་ནི་འགྲོ་ལ་མིག་ལྡན་པས། །
en: “The light rays of your wisdom reveal liberation, Your love pervades beings with diminished understanding, And your wisdom grants beings sight.

source: རྒྱལ་བ་ཡེ་ཤེས་ཉི་མ་འདིར་གཤེགས་གསོལ། །
en: Victor, sun of wisdom, please come to this place!

source: མཁྱེན་པས་ལྷ་དང་མི་མང་ཐར་བར་མཛད། །ཁྱོད་ཀྱི་ཡེ་ཤེས་སྲོག་དང་གང་ཟག་མེད། །
en: “You liberate many gods and humans with your knowledge, Though your wisdom contains neither a life force nor persons.

source: ཐུབ་པ་ཡེ་ཤེས་དཔའ་བ་འདི་ལ་འཇུག །ཉོན་མོངས་པ་ལ་སྦྱིན་མཛོད་དྲན་པ་གསུངས། །
en: Sage, wise hero, please enter this place, Practice generosity in this afflicted realm, and teach mindfulness!

source: ཉི་མ་ཟླ་བ་མཆོག་ཏུ་མཛེས་པའི་སྤྱན། །རྒྱལ་བ་སེམས་ཅན་ཐལ་མོ་སྦྱར་ལ་གསུངས། །
en: “Your supremely beautiful eyes are like the sun and the moon; Victor, please teach those beings who join their palms toward you!

source: ཐུབ་པ་བྱང་ཆུབ་མཆོག་ཕྱིར་བསྟན་དུ་གསོལ། །
en: Sage, please teach so we can attain supreme awakening!

source: འཕགས་པ་ཐུབ་པ་འདི་ལ་འཇུག་པ་གསུངས། །
en: Noble sage, please enter this place and teach!

source: རྒྱལ་བ་བྱང་ཆུབ་རྒྱུ་ཅན་མཛེས་གཟིགས་པ། །
en: “Victor, you possess the primary cause of awakening and your vision is magnificent.

source: ཕྱོགས་བཞི་འདིར་ནི་ཡང་དག་ལྷགས་མང་ལ། །སྟོང་པ་ཉིད་དང་བཟོད་སྤྱོད་ཤེས་གྱུར་གསུངས། །
en: Please explain the knowledge and conduct related to emptiness and acceptance To those many beings who have arrived here from the four directions!

source: རྒྱལ་བ་དཔའ་གཏོང་འདི་ལ་ཤིན་ཏུ་འདུག་བྲམ་ཟེའི་བྱིས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཡོན་ཏན་འདི་སྨྲས་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Victor who grants courage, please remain in this place!” The Blessed One expressed his consent as soon as the young brahmins had recounted the Blessed One’s qualities.

source: དེ་ནས་དྲང་སྲོང་ཐུབ་པ་གདན་དེ་ལས་བཞེངས་པ་དང་། དེ་ཉིད་ཀྱི་ཚེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཆེན་པོ་འདི་ལན་དྲུག་ཏུ་གཡོས་སོ། །ལྷ་དང་ཀླུ་དང་།
en: The sage Seer rose from his seat and at that very moment this entire great buddha realm shook in six ways.

source: གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དུ་མས་ཀྱང་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པར་ལྷ་རྫས་ཀྱི་མེ་ཏོག་གི་ཆར་མངོན་པར་ཕབ་བོ། །ལྷ་རྫས་ཀྱི་ཨ་ག་རུ་དང་། ཏ་ག་ར་དང་།
en: Many gods, nāgas, yakṣas, asuras, kinnaras, and mahoragas rained down showers of divine flowers everywhere in this Sahā buddha realm.

source: དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་ཆར་མངོན་པར་ཕབ་བོ། །ལྷ་རྫས་ཀྱི་གོས་དང་། རྒྱན་དང་ཡིད་བཞིན་གྱི་གོས་དང་། ནོར་བུ་དང་། མུ་ཏིག་གི་སེ་མོ་དོ་དང་རིན་པོ་ཆེའི་ཆར་མངོན་པར་ཕབ་བོ། །
en: They rained down showers of divine aloeswood, crape jasmine, and yellow sandalwood, as well as a rain of divine clothes, ornaments, wish-fulfilling garments, precious gems, pearl necklaces, and precious substances.

source: ལྷ་རྫས་ཀྱི་རོལ་མོ་རྡུང་བ་མངོན་པར་དཀྲོལ་ཏོ། །དབྱངས་ཀྱིས་ལྷུང་ལྷུང་ལྡེགས་ཀྱི་སྒྲ་ཕྱུང་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་སྔོན་མ་བསྟན་པའི་ཆོས་མཉན་པར་བགྱིའོ། །
en: They played divine music and exclaimed in a melodious stream, “We shall listen to this Dharma that has never been taught before!

source: བདུད་ཀྱི་ཡུལ་ལས་ཡང་དག་པར་ཤིན་དུ་འདའ་བར་བགྱིའོ། །
en: We shall overcome the domain of the māras!

source: ཉོན་མོངས་པའི་ཡུལ་གཞོམ་པར་བགྱིའོ། །
en: We shall conquer the domain of the afflictions!

source: ཡེ་ཤེས་ཀྱི་ཡུལ་ཁོང་དུ་ཆུད་པར་བགྱིའོ། །
en: We shall comprehend the domain of wisdom!

source: ཟབ་མོ་སྟོང་པ་ཉིད་ཀྱི་ལམ་ཁོང་དུ་ཆུད་པར་བགྱིའོ་ཞེས་གསོལ་པ་དང་།
en: We shall comprehend the path of profound emptiness!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཁང་པ་བརྩེགས་པ་དེ་དག་ལ་འཛེགས་ཏེ།
en: Then the Blessed One climbed the stairways leading to those storied mansions and sat on the lion throne that had been arranged for him.

source: སེང་གེའི་ཁྲི་བཤམས་པ་དེ་ཉིད་ལ་བཞུགས་ནས་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་ལྡན་པས་དང་ནམ་མཁའ་ཁྱབ་པའི་འཁོར་ཀུན་ཅང་མི་སྨྲ་བར་གྱུར་ནས་ཐལ་མོ་སྦྱར་ཏེ་སེམས་རྩེ་གཅིག་ཏུ་དྲང་སྲོང་ཐུབ་པ་ལ་ལྟ་བར་གྱུར་ཏོ། །
en: All the assemblies that filled the earth and the sky of this entire Sahā buddha realm fell silent and gazed at the sage Seer one-pointedly with their palms joined.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་ལྡན་པ་མ་ལུས་པར་ས་དང་ནམ་མཁའ་ཁྱབ་པའི་འཁོར་ལ་རྣམ་པར་གཟིགས་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །སེམས་ཅན་ཇི་སྙེད་འདིར་ནི་ཀུན་ལྷགས་པ། །བྱང་ཆུབ་འདོད་རྣམས་ཡོངས་སུ་ཆོས་ཚོལ་ན། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་རབ་བསྟན་གྱིས། །དེ་དག་ཐམས་ཅད་རྩེ་གཅིག་སེམས་སུ་ཉོན། །
en: When he saw those assemblies filling the earth and the sky of this entire buddha realm, the Blessed One uttered the following verses: “Since all the beings who have assembled here Wish for awakening and seek the Dharma, I will teach the supreme conduct of awakening; Listen to all these teachings with single-pointed focus!

source: སེམས་ཅན་ལ་ལ་གཏི་མུག་སྲེད་པས་བསྒྲིབས། །ཕུང་པོ་དག་ལའང་ལྟ་བ་རྣམ་མི་སྤོང་། །
en: “Some beings are obscured by delusion and craving And do not give up the views related to the aggregates.

source: གང་དག་ད་དུང་བྱང་ཆུབ་མཆོག་སྤྱོད་བརྩོན། །ཡང་ཡང་འདི་ལ་ཡོན་ཏན་ཅུང་ཟད་སྤྱོད། །
en: Furthermore, some strive for the supreme conduct of awakening And experience just a few qualities for their persistent efforts.

source: དབང་པོ་དྲུག་ལ་སྟོང་པ་མི་ལྟ་སྟེ། །མཚན་མ་མེད་པའི་འཛིན་པ་བདག་ལ་ཟུང་། །བྱང་ཆུབ་ཕྱིར་ནི་ཅུང་ཟད་བརྩོན་སྤྱོད་ཀྱི། །ཤེས་རབ་ཡོན་ཏན་ཐམས་ཅད་སྤྱོད་པ་མེད། །
en: “Those who do not regard the six sense faculties as empty, And cling to the apprehender that lacks characteristics as a self, May make some effort to attain awakening, But they will never experience all the qualities of insight.

source: ཇི་ལྟར་མེ་འདོད་ཁྱིམ་གྱི་ནང་དུ་ནི། །བཙལ་བས་ཀྱང་ནི་མེ་དག་རྙེད་མ་གྱུར། །དེ་ལྟར་སེམས་ཅན་ལ་ལ་བྱང་ཆུབ་འདོད། །སྟོང་མ་བསྒོམས་པར་ཤེས་རབ་ཐོབ་པ་མེད། །
en: “Just as those who want to have a fire in their house Will not find flames merely by searching for them, Beings who wish for awakening Will not gain insight without meditating on emptiness.

source: དེ་བས་གང་དག་བྱང་ཆུབ་སྡུག་འདོད་པ། །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་མཚན་མ་དག །རྨི་ལམ་སྨིག་རྒྱུ་ལྟ་བུར་ཐམས་ཅད་ལྟོས། །
en: “Therefore, all of you who wish for beloved awakening Must view all the aggregates, the elements, the sense fields, And marks as similar to dreams and mirages.

source: འདི་ནི་བྱང་ཆུབ་དམ་པ་མཆོག་གི་ལམ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ལ་བཀའ་སྩལ་པ།
en: This is the supreme path to ultimate awakening!”

source: རིགས་ཀྱི་བུ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་ཤིན་ཏུ་འདས་ཏེ་ང་ཡིར་བྱ་བ་དང་། བདག་གིར་བྱ་བ་ཐམས་ཅད་ཀྱི་སྲིད་པའི་བག་ལ་ཉལ་བ་དང་། མཚན་མ་མེད་པ་དང་། མ་རིག་པར་ལྟ་བ་ཐམས་ཅད་སྤངས་པར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འདྲེས་པ་མེད་པ་དང་། སེམས་ཅན་གྱི་གོ་ཆ་དང་།
en: The Blessed One then said to the bodhisattva Bhadrapāla, “Noble son, the bodhisattvas who abide in this acceptance of taming beings with the sky-colored method of perfect conduct will completely overcome all the domains of the māras, abandoning all the latent tendencies of craving associated with the notions of ownership and possession and the views related to ignorance and the absence of marks.

source: སེམས་སྒྱུ་མ་ལྟ་བུ་དང་། ཚོར་བ་དུ་བ་དང་། རྡུལ་དང་། ནམ་མཁའ་དང་། སྤྲིན་ལྟ་བུར་རབ་ཏུ་ཤེས་སོ། །
en: They will know that all world systems are uncontaminated, they will understand the armor of beings, and they will know that the mind is like an illusion and that feelings are similar to smoke, particles of dust, space, and clouds.

source: མཚན་མ་དང་མཚན་ཉིད་ཐམས་ཅད་ནམ་མཁའ་སྤྲོས་པ་ལྟ་བུར་རབ་ཏུ་ཤེས་སོ། །དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་འདས་པར་འགྱུར་རོ། །
en: They will know that all marks and characteristics are space-like elaborations, and they will transcend all roots of virtue.

source: ལས་ཡོངས་སུ་ཟད་ཅིང་སེམས་ཅན་ཉེ་བར་འཚོ་བར་ཡང་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་མ་བསྐྱེད་པའི་གཉེན་ལྟ་བུར་འགྱུར་རོ། །
en: Their karma will be completely extinguished, they will look after beings, and they will act as friends for both those who have created roots of virtue and those who have not.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པ་སྟོན་པར་འགྱུར་རོ། །ཕ་རོལ་གྱི་རྒོལ་བ་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་པར་ཐལ་བ་མེད་པར་འགྱུར་རོ། །
en: They will deliver all the teachings of the Buddha without obstruction, and they will pulverize all their opponents as numerous as the sky is vast.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པ་སེང་གེ་ལྟ་བུ་དང་། རྒྱ་མཚོ་ཆེན་པོ་ལྟ་བུ་ཆོས་ཆེན་པོའི་ཆར་གྱི་ཆུ་བོ་རབ་ཏུ་གཏོང་བ་དང་།
en: They will spread all the teachings of the Buddha like lions and send forth torrents of great Dharma teachings like a great ocean.

source: འཁྲུལ་བ་མེད་པའི་མངོན་པར་ཤེས་པ་དང་། ཆགས་པ་མེད་པའི་སྤོབས་པ་དང་ལྡན་པ་དང་། བསྟོད་པ་དང་རབ་ཏུ་བསྔགས་པར་འགྱུར་རོ། །
en: They will have undeluded supernormal faculties and eloquence without attachment, and they will be praised and glorified.

source: རིགས་ཀྱི་བུ་བཟོད་པ་འདི་བསྒོམས་པ་ནས་ལུས་དཔང་དུ་བཙུགས་པའི་བར་དུ་འདི་ལས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པར་འགྱུར་རོ། །
en: Noble son, from the moment that they have cultivated this acceptance until their body is brought under control, and after this, they will achieve inconceivable buddha qualities.

source: རིགས་ཀྱི་བུ་དེ་ལ་བཟོད་པ་འདི་རྣམ་པ་གཉིས་ཏེ། ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་གྱི་བཟོད་པ་དང་། ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པར་འགྱུར་རོ། །
en: “Noble son, there are two aspects to this acceptance: the acceptance as a method of perfect conduct, and the acceptance that tames through being sky-colored.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་གྱི་བཟོད་པ་གང་ཞེ་ན།
en: Noble son, what is the acceptance that is a method of perfect conduct?

source: རྣམ་པ་ལྔ་སྟེ།
en: There are five aspects to this.

source: རིགས་ཀྱི་བུ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་གྱི་བཟོད་པ་རྣམ་པ་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those five aspects of the acceptance that is a method of perfect conduct?

source: གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: Forms, feelings, perceptions, formations, and consciousnesses.

source: འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། །རིགས་ཀྱི་བུ་དེ་ལ་གཟུགས་ཀྱི་ཕུང་པོ་གང་ཞེ་ན།
en: Noble son, what is the aggregate of form?

source: རིགས་ཀྱི་བུ་རྣམ་པ་བརྒྱད་དེ། བྱང་ཆུབ་སེམས་དཔས་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་བརྟགས་པའི་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: Noble son, it has eight aspects that a bodhisattva should think about and analyze correctly.

source: རིགས་ཀྱི་བུ་བརྒྱད་གང་ཞེ་ན། གཟུགས་ཞེས་བྱ་བ་ནི་འབྱུང་བ་ཆེན་པོ་བཞིའོ། །
en: What are those eight aspects, noble son?

source: གཟུགས་ཞེས་བྱ་བ་ནི་ནད་དོ། །འདོད་ཆགས་ཞེས་བྱ་བ་ནི་རྣམ་པར་འཇིག་པའི་ཆོས་ཀྱི་མཚན་ཉིད་དོ། །གང་རྣམ་པར་འཇིག་པའི་རང་བཞིན་དེ་ནི་མི་རྟག་པའོ། །དེའི་རང་བཞིན་ནི་དངོས་པོ་མེད་པའི་སྟོང་པ་ཉིད་ཡོངས་སུ་ཆད་པའོ། །ཕྱི་དང་ནང་གི་རབ་འབྲིང་ཐ་མའི་ཉོན་མོངས་པའི་རྒྱུན་བཅད་པའོ། །
en: Forms are made of the four great elements; forms are diseases; desires have the characteristic of phenomena that disintegrate; whatever has the nature of disintegrating is impermanent; it has the nature of insubstantiality, emptiness, and annihilation; and both inner and outer severe, middling, and minor afflictions are eliminated.

source: ནམ་མཁའ་ཇི་ལྟར་ཐམས་ཅད་དང་ལྡན་པ་དེ་བཞིན་དུ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། སྟོང་པའི་མཚན་ཉིད་དང་ལྡན་པའི་བཟོད་པ་སྒོམ་པར་བྱེད་དོ། །
en: Bodhisattvas cultivate acceptance that has the characteristics of being impermanent, suffering, lacking a self, and being as empty as the whole of space.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པར་བལྟ་བར་བྱའོ། །
en: This should be regarded as the bodhisattvas’ acceptance that ripens and looks after beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གཟུགས་དེ་ཡང་འབྱུང་བ་ཆེན་པོ་བཞི་སྟེ། རིགས་ཀྱི་བུ་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་འདི་དག་ནང་གི་འམ། ཕྱི་རོལ་གྱིའམ། ཆེ་བའམ། ཕྲ་བའམ། དམའ་བའམ། བདེ་བའམ།
en: “Furthermore, noble son, forms are made of the four great elements.

source: གལ་ཏེ་རིང་བའམ། གལ་ཏེ་ཉེ་བ་དེ་དག་ཐམས་ཅད་མི་འགྲོ །རྣམ་པར་མི་འགྲོ །མི་སྐྱེ། མི་འབྱུང་བདག་མེད་བདག་གི་མེད་པར་བརྟག་པར་བྱའོ། །
en: Noble son, whether the four great elements are internal, external, big, small, inferior, blissful, far, or near, they should all be analyzed as not going, not leaving, not arising, not originating, lacking a self, and without ownership.

source: ཟད་པའི་ཚུལ་དང་། ཞི་གནས་ཀྱི་མཚན་ཉིད་ཀྱི་ཚུལ་དང་། རྟོག་པ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཚུལ་དང་། འབྱུང་བ་མེད་ཅིང་མཚན་མ་མེད་པའི་ཚུལ་གྱིས་བརྟག་པར་བྱའོ། །
en: They should be analyzed as being extinguished, having the characteristic of tranquility, and being devoid of concepts, without purpose, without origination, and without marks.

source: ཇི་ལྟར་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཀུན་འབྱུང་བ་དང་། ལུས་ཀུན་འབྱུང་བའི་ཕྱིར་ནང་གི་སའི་ཁམས་སྲ་བར་བརྟག་པར་བྱའོ། །
en: “Since it is the source of extremely subtle particles as well as the body, one should analyze the solid inner element of earth.

source: ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་གཅིག་པོ་དེ་ལ་ཇི་ལྟར་ལྷག་མཐོང་ཕྲ་མོས་བརྟག །རྡུལ་ཕྲ་མོ་གཅིག་པོ་དེ་ལ་ཇི་ལྟར་མཚན་ཉིད་མེད་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་དུ་གྱུར་པར་རབ་ཏུ་ཤེས།
en: When bodhisattvas analyze a single extremely subtle particle with subtle special insight, they understand that this single subtle particle has the same behavior as all the afflictions, which are devoid of characteristics.

source: བདག་མེད་པ་དང་། རྣམ་པ་དང་བྲལ་བར་རབ་ཏུ་ཤེས།
en: They understand that it lacks a self and is free from aspects.

source: དངོས་པོ་མེད་པ་དང་། ཚིག་གི་ལམ་དང་བྲལ་བ་དང་། དམིགས་པ་མེད་པ་དང་། སྒྲ་དབྱངས་ཐམས་ཅད་དང་བྲལ་བར་རབ་ཏུ་ཤེས།
en: They understand that it is insubstantial, free from words, without apprehension, and free from all spoken sounds.

source: བདག་མེད་པ་དང་བྲལ་བ་དང་། བདུད་ཀྱི་མཚན་ཉིད་རབ་ཏུ་ཤེས།
en: They understand that it is free from the lack of self, and that it has the characteristics of Māra.

source: ཡི་གེ་མེད་པ་དང་། རྒྱུ་དང་རྐྱེན་དང་བྲལ་བར་རབ་ཏུ་ཤེས།
en: They understand that it is wordless and free from causes and conditions.

source: དངོས་པོ་མེད་པ་དང་། རྒྱུ་དང་རྐྱེན་དང་བྲལ་བར་རབ་ཏུ་ཤེས།
en: They understand that it is insubstantial and free from causes and conditions.

source: མཚན་མ་མེད་པ་ལས་རྡུལ་ཤིན་ཏུ་ཕྲ་བར་རབ་ཏུ་ཤེས།
en: They understand this extremely subtle particle as devoid of characteristics.

source: ཇི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་རབ་ཏུ་ཞི་བ་ལ་རྣམ་པ་བརྒྱད་པོ་དེ་དག་གིས་རྡུལ་ཤིན་ཏུ་ཕྲ་མོ་གཅིག་ཏུ་བརྟག་གོ། །དེ་བཞིན་དུ་གཉིས་པ་དང་། དེ་བཞིན་དུ་གསུམ་པ་ནས་ནང་གི་ལུས་ཐམས་ཅད་ཀྱི་བར་དུ་གཅིག་ལ་ཡང་སོ་སོར་རྣམ་པ་བརྒྱད་པོ་འདི་དག་གིས་རྡུལ་ཤིན་ཏུ་ཕྲ་མོ་གཅིག་ཏུ་བརྟག་གོ། །
en: Just as they analyze the pacification of all formations in the context of a single extremely subtle particle using those eight aspects, in the same way they analyze two of those particles, then three, all the way up to the entire internal body, using each one of those eight aspects in the same way that they analyze that single extremely subtle particle.

source: ནང་གི་ལུས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱི་རོལ་གྱི་ལུས་ཀྱི་སའི་ཁམས་ཀྱང་རྣམ་པ་བརྒྱད་པོ་འདི་དག་གིས་སོ་སོར་རྡུལ་ཤིན་ཏུ་ཕྲ་བར་བརྟག་གོ། །མཚན་ཉིད་མེད་པ་ནས་མཚན་མ་མེད་པའི་བར་དུ་སའི་ཁམས་ཐམས་ཅད་ནང་གིའམ། ཕྱི་རོལ་གྱི་འམ། ཆེ་བའམ་ཕྲ་བའམ།
en: They analyze the earth element of the external body in the same way that they analyze the internal body in terms of that single extremely subtle particle using these eight aspects.

source: དམའ་བའམ། བདེ་བའམ། གང་རིང་བའམ། གང་ཉེ་བ་དེ་དག་ཐམས་ཅད་ཟད་པའི་ཆོས་སུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: Proceeding from their lack of characteristics to their lack of marks, they correctly see all earth elements, whether they be internal, external, big, small, inferior, blissful, far, or near, as having the quality of perishing.

source: གང་ཟད་པ་འདི་ནི་མི་རྟག་པའོ། །
en: Whatever perishes is impermanent.

source: གང་མི་རྟག་པ་འདི་ཡང་སྡུག་བསྔལ་བའོ། །
en: Whatever is impermanent is suffering.

source: གང་མི་འབྱུང་བ་དེ་བདག་མེད་པའོ། །
en: Whatever does not arise lacks a self.

source: གང་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཚིག་གི་ལམ་དང་ཕྲལ་བ་དེ་ཡང་སྟོང་པ་སྟེ།
en: Whatever is compounded is free from all language and empty.

source: ཇི་ལྟར་ཕྱི་དང་ནང་གི་སའི་ཁམས་ཇི་ལྟ་བ་བཞིན་དུ་སྟོང་པར་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པ་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: Since they correctly understand that the external and internal earth elements are empty, they pacify the severe, middling, and minor afflictions.

source: ནམ་མཁའ་ཇི་ལྟར་འདུ་ཤེས་མེད་ཅིང་ཚོར་བ་མེད་པ་དེ་བཞིན་དུ་སའི་ཁམས་ཀྱང་འདུ་ཤེས་མེད་ཅིང་ཚོར་བ་མེད་པ་དང་།
en: The earth element lacks perception and lacks feeling in the same way that space lacks perception and lacks feeling.

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པའི་མཚན་ཉིད་དང་ལྡན་པའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པར་བལྟ་བར་བྱའོ། །
en: This cultivation of the acceptance that it has the characteristics of being impermanent, suffering, lacking a self, and being empty should also be regarded as the bodhisattvas’ acceptance that ripens and looks after all beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ལུས་འདི་ལ་གཤེར་བའི་མཚན་ཉིད་ནི་ཆུ་སྟེ།
en: “Furthermore, noble son, with respect to the body, water is anything that has the characteristic of being moist.

source: ཆུའི་མཚན་ཉིད་ཕྲན་ཚེགས་སུ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་དུ་ནང་གི་ལུས་ཆུའི་ཁམས་ཐམས་ཅད་སོ་སོར་ཐིགས་པ་ཙམ་དུ་ལྷག་མཐོང་གི་ཚུལ་གྱིས་བརྟག་གོ། །ཆེ་བའམ། ཕྲ་བའམ། དམའ་བའམ།
en: Bodhisattvas use special insight to analyze each and every water element of the internal body in terms of the most minute characteristics of water in a mere droplet measuring a fraction of the point of one strand of hair.

source: བདེ་བའི་མཚན་ཉིད་མེད་པ་ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་ནས་མཚན་མ་མེད་པའི་བར་དུ་དེ་དག་ཐིགས་པ་ཙམ་དུ་འདུ་བྱེད་ཐམས་ཅད་ཉེ་བར་ཞི་བར་རབ་ཏུ་ཤེས་པ་ཇི་ལྟ་བུར་ཐིགས་པ་གཅིག་ལ་རྣམ་པ་བརྒྱད་པོ་དེ་དག་གིས་ཇི་ལྟ་བ་བཞིན་དུ་བརྟག་གོ། །
en: From the point that they correctly understand that this drop is devoid of the characteristics of being big, small, inferior, or blissful, and that it is free from all afflictions up to being without characteristics, and they understand that all formations are completely pacified in a mere drop, this is how they correctly analyze a single drop of water using those eight aspects.

source: དེ་བཞིན་དུ་གཉིས་པ་དང་། དེ་བཞིན་དུ་གསུམ་པ་ནས་ནང་གི་ལུས་ཀྱི་ཆུའི་ཁམས་ཐམས་ཅད་རྣམ་པ་བརྒྱད་པོ་དེ་དག་གིས་སོ་སོ་རེ་རེ་ལ་ཐིགས་པ་ཕྲ་བ་ཇི་ལྟ་བ་བཞིན་དུ་བརྟག་གོ། །
en: They correctly analyze each and every drop using those eight aspects, from one, then two, and up to all of the water elements of the internal body.
